
{
	"en" : {
		"title" : "About Me",
		"whoAmI": "Who am I ?",
		"whoAmIDesc": "I'm a computer science student at the University of Paris 8, Saint Denis. I'm passionate about creating interactive, graphic effects. I am also interested in web development and machine learning.",
		"whatIDo": "What I do ?",
		"whatIDoDesc": "I'm currently working on a project to create a website to showcase my projects. I'm also learning about machine learning and deep learning.",
		"cvButton": "Resume",
		"cvButtonTitle": "Download my CV",
		"leftBtn": "Scroll Left",
		"rightBtn": "Scroll Right",
		"title2" : "My Skills",
		"content2": "I have experience in web development using HTML, CSS, JavaScript, and PHP. I have also worked with the Bootstrap and jQuery libraries. I have experience in machine learning using Python and the TensorFlow library. I have also worked with the Keras library. I have experience in creating interactive, graphic effects using WebGL and the Three.js library. I have also worked with the GLSL language.",
		"skills" : {
			"webDev" : "Web Development",
			"webDevDesc" : "I have experience in web development using HTML, CSS, JavaScript, and PHP. I have also worked with the Bootstrap and jQuery libraries.",
			"ml" : "Machine Learning",
			"mlDesc" : "I have experience in machine learning using Python and the TensorFlow library. I have also worked with the Keras library.",
			"graphics" : "Graphics",
			"graphicsDesc" : "I have experience in creating interactive, graphic effects using WebGL and the Three.js library. I have also worked with the GLSL language."
		}
	},
	"fr" : {
		"title" : "A propos de moi",
		"whoAmI": "Qui suis-je ?",
		"whoAmIDesc": "Je suis étudiant en informatique à l'Université de Paris 8, Saint Denis. Je suis passionné par la création d'effets graphiques interactifs. Je m'intéresse également au développement web et à l'apprentissage automatique.",
		"whatIDo": "Que fais-je ?",
		"whatIDoDesc": "Je travaille actuellement sur un projet de création d'un site web pour présenter mes projets. J'apprends également sur l'apprentissage automatique et le deep learning.",
		"cvButton": "Résumé",
		"cvButtonTitle": "Télécharger mon CV",
		"leftBtn": "Défiler à gauche",
		"rightBtn": "Défiler à droite",
		"title2" : "Mes Compétences",
		"content2": "J'ai de l'expérience dans le développement web en utilisant HTML, CSS, JavaScript et PHP. J'ai également travaillé avec les bibliothèques Bootstrap et jQuery. J'ai de l'expérience dans l'apprentissage automatique en utilisant Python et la bibliothèque TensorFlow. J'ai également travaillé avec la bibliothèque Keras. J'ai de l'expérience dans la création d'effets graphiques interactifs en utilisant WebGL et la bibliothèque Three.js. J'ai également travaillé avec le langage GLSL.",
		"skills" : {
			"webDev" : "Développement Web",
			"webDevDesc" : "J'ai de l'expérience dans le développement web en utilisant HTML, CSS, JavaScript et PHP. J'ai également travaillé avec les bibliothèques Bootstrap et jQuery.",
			"ml" : "Apprentissage Automatique",
			"mlDesc" : "J'ai de l'expérience dans l'apprentissage automatique en utilisant Python et la bibliothèque TensorFlow. J'ai également travaillé avec la bibliothèque Keras.",
			"graphics" : "Graphiques",
			"graphicsDesc" : "J'ai de l'expérience dans la création d'effets graphiques interactifs en utilisant WebGL et la bibliothèque Three.js. J'ai également travaillé avec le langage GLSL."
		}
	}
}
